app/controllers/url_maps_controller.rb

SELECT * FROM "url_maps" ORDER BY created_at desc
---
  def index
    @url_maps = UrlMap.all

SELECT * FROM "url_maps" WHERE ("url_maps"."id" = 1)
---
  def show
    @url_map = UrlMap.find(params[:id])

SELECT "url_maps".id FROM "url_maps" WHERE ("url_maps"."short_url" = 'hreed') LIMIT 1
INSERT INTO "tags_url_maps" ("created_at", "tag_id", "updated_at", "url_map_id") VALUES ('2012-02-12 17:07:10', 3, '2012-02-12 17:07:10', 3)
INSERT INTO "url_maps" ("short_url", "long_url", "created_at", "updated_at") VALUES('google', 'http://google.com', '2012-02-12 21:49:39.437731', '2012-02-12 21:49:39.437731') RETURNING "id"
---
  def create
    @url_map = UrlMap.new(params[:url_map])
    result = UrlMap.validation_result(params[:url_map][:short_url])
    if result!="available"
      flash[:error]=result
      render :action=>'new'
    else
      @url_map.short_url=UrlMap.random_unique_string(6) if params[:url_map][:short_url].empty?
      if @url_map.save

SELECT * FROM "url_maps" WHERE ("url_maps"."id" = 5)
---
  def edit
      @url_map = UrlMap.find(params[:id])

SELECT * FROM "url_maps" WHERE ("url_maps"."id" = 5)
SELECT "url_maps".id FROM "url_maps" WHERE ("url_maps"."short_url" = 'google' AND "url_maps".id <> 5) LIMIT 1
UPDATE "url_maps" SET "updated_at" = '2012-02-12 22:17:21.072168', "long_url" = ' asfasdfasdfasd', "short_url" = 'dfd df' WHERE "id" = 1
SELECT count(*) AS count_all FROM "tags" INNER JOIN "tags_url_maps" ON "tags".id = "tags_url_maps".tag_id WHERE ("tags_url_maps".url_map_id = 5 )
---
  def update
    @url_map = UrlMap.find(params[:id])
    result = UrlMap.validation_result(params[:url_map][:short_url])
    if result!="available"
      flash[:error]=result
      render :action=>'new'
    else
      params[:url_map][:short_url] =UrlMap.random_unique_string(6) if params[:url_map][:short_url].empty?
      if @url_map.update_attributes(params[:url_map])
         @url_map.update_tags params
         puts "result"
         puts @url_map.tags.count

SELECT * FROM "url_maps" WHERE ("url_maps"."id" = 2)
DELETE FROM "tags_url_maps" WHERE url_map_id = 1 AND tag_id IN (1)
DELETE FROM "url_maps" WHERE "id" = 2
---
  def destroy
    @url_map = UrlMap.find(params[:id])
    @url_map.destroy

SELECT * FROM "tags" WHERE (name like '%li%')
---
  def tag_list
    escaped_query =  params[:q].gsub ('%', '\%').gsub ('_', '\_')

    render :json=>Tag.find(:all,:conditions=>["name like ?", "%#{escaped_query}%"]).map{|x| {:id=>x.id,:name=>x.name}}

SELECT * FROM "url_maps" WHERE ("url_maps"."short_url" = 'google')
---
  def redirect
    redirect_to UrlMap.find(:all,:conditions=>{:short_url=>params[:short_url]})[0].long_url